app/Controllers/AdminBookingsController.php

SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
ORDER BY `bookings`.`check_in` DESC
---
    public function index(): string
    {
        $bookings = (new BookingModel())
            ->withRelations()
            ->orderBy('bookings.check_in', 'DESC')
            ->findAll();