app/Controllers/AdminTenantsController.php

SELECT *
FROM `tenants`
WHERE `tenants`.`id` = 1
---
    private function findTenantOrFail(int $id): array
    {
        $tenant = (new TenantModel())->find($id);