app/Controllers/AdminRoomsController.php

SELECT *
FROM `rooms`
ORDER BY `room_number` ASC
---
    public function index(): string
    {
        $roomModel = new RoomModel();

        return view('admin/rooms/index', [
            'title' => 'Rooms',
            'rooms' => $roomModel->orderBy('room_number', 'ASC')->findAll(),
        ]);