app/Controllers/AdminDashboardController.php

    public function index(): string
    {
        $roomModel    = new RoomModel();
        $tenantModel  = new TenantModel();
        $bookingModel = new BookingModel();

        $stats = [
            'totalRooms'      => $roomModel->countAllResults(),
            'availableRooms'  => $roomModel->where('status', 'available')->countAllResults(),
            'totalTenants'    => $tenantModel->countAllResults(),
            'activeBookings'  => $bookingModel->whereIn('status', ['pending', 'checked_in'])->countAllResults(),
            'completedStays'  => $bookingModel->where('status', 'checked_out')->countAllResults(),
        ];

        $recentBookings = $bookingModel->withRelations()
            ->orderBy('bookings.check_in', 'DESC')
            ->findAll(5);

        $roomsByStatus = [];
        foreach (room_status_options() as $statusKey => $label) {
            $roomsByStatus[] = [
                'label' => $label,
                'count' => $roomModel->where('status', $statusKey)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `rooms`
WHERE `status` = 'available'
SELECT COUNT(*) AS `numrows`
FROM `tenants`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` IN ('pending','checked_in')
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'checked_out'
SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
ORDER BY `bookings`.`check_in` DESC
 LIMIT 5