app/Controllers/AuthController.php

    private function handleLogin(string $expectedRole): RedirectResponse
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $email     = strtolower(trim((string) $this->request->getPost('email')));
        $password  = (string) $this->request->getPost('password');
        $user      = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'maria@example.com'
 LIMIT 1