app/Controllers/PasswordResetController.php

        $now       = date('Y-m-d H:i:s');
        $resetOtp  = new PasswordResetOtpModel();

        $resetOtp
            ->where('user_id', $account['user']['id'])
            ->where('role', $role)
            ->where('consumed_at', null)
            ->set('consumed_at', $now)
            ->update();

        $resetId = $resetOtp->insert([
            'user_id'            => $account['user']['id'],
            'role'               => $role,
            'channel'            => $channel,
            'identifier_hash'    => $identifierHash,
            'otp_hash'           => password_hash($otp, PASSWORD_DEFAULT),
            'masked_destination' => $this->maskDestination($destination, $channel),
            'attempts'           => 0,
            'send_count'         => 1,
            'last_sent_at'       => $now,
            'expires_at'         => $expiresAt,
            'request_ip'         => $this->request->getIPAddress(),
        ]);
---
UPDATE `password_reset_otps` SET `consumed_at` = '2026-04-29 09:15:45', `updated_at` = '2026-04-29 09:15:45'
WHERE `user_id` = '5'
AND `role` = 'tenant'
AND `consumed_at` IS NULL
INSERT INTO `password_reset_otps` (`user_id`, `role`, `channel`, `identifier_hash`, `otp_hash`, `masked_destination`, `attempts`, `send_count`, `last_sent_at`, `expires_at`, `request_ip`, `created_at`, `updated_at`) VALUES ('5', 'tenant', 'sms', '6a03c9579f1bd06837940ba680aa70484d30fe4f69508c4fd1a628e28509301d', '$2y$10$mygXuSjir15Wnk/h83b8MuIFIwQw8dkvsBqCiVFpx4Hda6UT1K7nS', '*******2977', 0, 1, '2026-04-29 09:15:45', '2026-04-29 09:25:45', '::1', '2026-04-29 09:15:45', '2026-04-29 09:15:45')

    private function findTenantAccount(string $identifier): ?array
    {
        $tenant = null;

        if (filter_var($identifier, FILTER_VALIDATE_EMAIL)) {
            $tenant = (new TenantModel())
                ->where('email', strtolower($identifier))
                ->first();
        } else {
            $normalizedPhone = $this->normalizePhone($identifier);

            if ($normalizedPhone !== '') {
                foreach ((new TenantModel())->findAll() as $candidate) {
                    if ($this->normalizePhone((string) ($candidate['phone'] ?? '')) === $normalizedPhone) {
                        $tenant = $candidate;
                        break;
                    }
                }
            }
        }

        if ($tenant === null) {
            return null;
        }

        $user = (new UserModel())
            ->where('role', 'tenant')
            ->where('tenant_id', $tenant['id'])
            ->first();
---
SELECT *
FROM `tenants`
SELECT *
FROM `users`
WHERE `role` = 'tenant'
AND `tenant_id` = '5'
 LIMIT 1

    private function hasTooManyRequests(string $role, string $identifierHash): bool
    {
        $windowStart = date('Y-m-d H:i:s', strtotime('-' . self::RATE_WINDOW_MINUTES . ' minutes'));
        $ipAddress   = $this->request->getIPAddress();
        $model       = new PasswordResetOtpModel();

        $identifierCount = $model
            ->where('role', $role)
            ->where('identifier_hash', $identifierHash)
            ->where('created_at >=', $windowStart)
            ->countAllResults();

        $ipCount = (new PasswordResetOtpModel())
            ->where('role', $role)
            ->where('request_ip', $ipAddress)
            ->where('created_at >=', $windowStart)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `password_reset_otps`
WHERE `role` = 'tenant'
AND `identifier_hash` = '6a03c9579f1bd06837940ba680aa70484d30fe4f69508c4fd1a628e28509301d'
AND `created_at` >= '2026-04-29 09:00:45'
SELECT COUNT(*) AS `numrows`
FROM `password_reset_otps`
WHERE `role` = 'tenant'
AND `request_ip` = '::1'
AND `created_at` >= '2026-04-29 09:00:45'