app/Controllers/TenantDashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tenant_id` = 1
AND `check_in` > '2026-04-25'
AND `status` IN ('pending','checked_in')
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tenant_id` = 1
AND `check_in` <= '2026-04-25'
AND `check_out` > '2026-04-25'
AND `status` IN ('pending','checked_in')
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tenant_id` = 1
AND `status` = 'checked_out'
SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
WHERE `bookings`.`tenant_id` = 1
AND `bookings`.`check_out` >= '2026-04-25'
ORDER BY `bookings`.`check_in` ASC
 LIMIT 1
SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
WHERE `bookings`.`tenant_id` = 1
ORDER BY `bookings`.`check_in` DESC
 LIMIT 5
---
    public function index(): string
    {
        $tenantId = auth_tenant_id();
        $today    = date('Y-m-d');

        $stats = [
            'totalBookings'    => (new BookingModel())->where('tenant_id', $tenantId)->countAllResults(),
            'upcomingBookings' => (new BookingModel())
                ->where('tenant_id', $tenantId)
                ->where('check_in >', $today)
                ->whereIn('status', ['pending', 'checked_in'])
                ->countAllResults(),
            'activeStays'      => (new BookingModel())
                ->where('tenant_id', $tenantId)
                ->where('check_in <=', $today)
                ->where('check_out >', $today)
                ->whereIn('status', ['pending', 'checked_in'])
                ->countAllResults(),
            'completedStays'   => (new BookingModel())
                ->where('tenant_id', $tenantId)
                ->where('status', 'checked_out')
                ->countAllResults(),
        ];

        $nextBooking = (new BookingModel())
            ->withRelations()
            ->where('bookings.tenant_id', $tenantId)
            ->where('bookings.check_out >=', $today)
            ->orderBy('bookings.check_in', 'ASC')
            ->first();

        $recentBookings = (new BookingModel())
            ->withRelations()
            ->where('bookings.tenant_id', $tenantId)
            ->orderBy('bookings.check_in', 'DESC')
            ->findAll(5);

SELECT *
FROM `tenants`
WHERE `tenants`.`id` = 1
---
            'stats'          => $stats,
            'nextBooking'    => $nextBooking,
            'recentBookings' => $recentBookings,
            'tenant'         => (new TenantModel())->find($tenantId),