app/Controllers/TenantBookingsController.php

    public function index(): string
    {
        $bookings = (new BookingModel())
            ->withRelations()
            ->where('bookings.tenant_id', auth_tenant_id())
            ->orderBy('bookings.check_in', 'DESC')
            ->findAll();
---
SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
WHERE `bookings`.`tenant_id` = 4
ORDER BY `bookings`.`check_in` DESC