app/Models/AdminReportModel.php

SELECT `id`, `room_id`, `tenant_id`, `check_in`, `check_out`, `total_amount`, `status`
FROM `bookings`
ORDER BY `check_in` DESC
---
    private function getAnalyticsBookings(): array
    {
        return $this->db->table('bookings')
            ->select('id, room_id, tenant_id, check_in, check_out, total_amount, status')
            ->orderBy('check_in', 'DESC')
            ->get()
            ->getResultArray();

SELECT `bookings`.*, `rooms`.`room_number`, `rooms`.`type` AS `room_type`, `tenants`.`full_name` AS `tenant_name`
FROM `bookings`
JOIN `rooms` ON `rooms`.`id` = `bookings`.`room_id`
JOIN `tenants` ON `tenants`.`id` = `bookings`.`tenant_id`
ORDER BY `bookings`.`check_in` DESC
 LIMIT 8
---
    private function getRecentBookings(int $limit): array
    {
        return $this->db->table('bookings')
            ->select('bookings.*, rooms.room_number, rooms.type AS room_type, tenants.full_name AS tenant_name')
            ->join('rooms', 'rooms.id = bookings.room_id')
            ->join('tenants', 'tenants.id = bookings.tenant_id')
            ->orderBy('bookings.check_in', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `id`, `room_number`, `type`, `capacity`, `price_per_night`, `status`
FROM `rooms`
ORDER BY `room_number` ASC
---
    private function getRoomInventory(): array
    {
        return $this->db->table('rooms')
            ->select('id, room_number, type, capacity, price_per_night, status')
            ->orderBy('room_number', 'ASC')
            ->get()
            ->getResultArray();

SELECT `status`, COUNT(*) AS room_count
FROM `rooms`
GROUP BY `status`
---
    private function getRoomStatusBreakdown(): array
    {
        $counts = array_fill_keys(array_keys(self::ROOM_STATUS_LABELS), 0);
        $rows   = $this->db->table('rooms')
            ->select('status, COUNT(*) AS room_count')
            ->groupBy('status')
            ->get()
            ->getResultArray();

SELECT `status`, COUNT(*) AS booking_count, COALESCE(SUM(total_amount), 0) AS total_amount
FROM `bookings`
GROUP BY `status`
---
    private function getBookingStatusBreakdown(): array
    {
        $metrics = [];

        foreach (self::BOOKING_STATUS_LABELS as $status => $label) {
            $metrics[$status] = [
                'status' => $status,
                'label'  => $label,
                'count'  => 0,
                'amount' => 0.0,
            ];
        }

        $rows = $this->db->table('bookings')
            ->select('status, COUNT(*) AS booking_count, COALESCE(SUM(total_amount), 0) AS total_amount')
            ->groupBy('status')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tenants`
---
            'availableRooms'      => $roomCounts['available'] ?? 0,
            'occupiedRooms'       => $roomCounts['occupied'] ?? 0,
            'maintenanceRooms'    => $roomCounts['maintenance'] ?? 0,
            'totalTenants'        => $this->db->table('tenants')->countAllResults(),